src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КодГосударственногоОргана</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВидГосударственногоОргана</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УдалитьЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="67fc19c3-1b39-455a-a36d-977ccc7986e6">
    <name>ОбособленноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fac2f68b-89ca-4292-ac3f-e6803b093aec">
    <name>ГосударственныйОрган</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="56ba8e3c-152e-472e-978c-1c8a27110815">
    <name>ЮридическоеФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="62afa2d4-135f-44b9-aeb8-d536b15d0b0f">
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5d5825e6-3ce4-45b1-b381-4ca2c180c292">
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5f2d0eed-be8d-428e-b069-3c1f0e091139">
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ed3160d7-bf41-4fa7-b0c0-314e4b913418">
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="822dc11f-971f-42ce-bea9-d73bd3da4fba">
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="66f390f7-3e60-482a-aeb1-c99f1f343346">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="45d2eecb-2dd4-4f02-9eec-3b4f3eae095f">
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1a44c1d6-4cdc-42bb-8de5-d50750ac626d">
      <name>ВидДляСписка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
&Вместо("ЮрАдресКонтрагентаНажатие")
Процедура Базар_ЮрАдресКонтрагентаНажатие(Элемент, СтандартнаяОбработка)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Страна", Объект.СтранаРегистрации);
	Если ЗначениеЗаполнено(Объект.Ссылка) тогда
		ПараметрыОткрытия.Вставить("Контрагент", Объект.Ссылка);
	КонецЕсли;
	ПараметрыОткрытия.Вставить("НаименованиеКонтрагента", Объект.Наименование);
	УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, Модифицированность, СтандартнаяОбработка, ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
&Вместо("ФактАдресКонтрагентаНажатие")
Процедура Базар_ФактАдресКонтрагентаНажатие(Элемент, СтандартнаяОбработка)
	
	ПараметрыОткрытия = Новый Структура();
	Если ЗначениеЗаполнено(Объект.Ссылка) тогда
		ПараметрыОткрытия.Вставить("Контрагент", Объект.Ссылка);
	КонецЕсли;
	ПараметрыОткрытия.Вставить("НаименованиеКонтрагента", Объект.Наименование);
	УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, Модифицированность, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
&Вместо("ПочтовыйАдресКонтрагентаНачалоВыбора")
Процедура Базар_ПочтовыйАдресКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Страна", Объект.СтранаРегистрации);
	Если ЗначениеЗаполнено(Объект.Ссылка) тогда
		ПараметрыОткрытия.Вставить("Контрагент", Объект.Ссылка);
	КонецЕсли;
	ПараметрыОткрытия.Вставить("НаименованиеКонтрагента", Объект.Наименование);
	УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, Модифицированность, СтандартнаяОбработка, ПараметрыОткрытия);
	
КонецПроцедуры

&НаСервере
Процедура Базар_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если РольДоступна("ДобавлениеИзменениеКонтактнойИнформацииКонтрагентов") тогда
		
		РодительскиеГруппы = Новый Массив;
		РодительскиеГруппы.Добавить("ГруппаКонтактнаяИнформация");
		РодительскиеГруппы.Добавить("ГруппаАдреса");
		РодительскиеГруппы.Добавить("ГруппаКомпоновкиКонтактнойИнформации");
		РодительскиеГруппы.Добавить("ГруппаЮридическийАдресКонтрагента");
		РодительскиеГруппы.Добавить("ГруппаФактАдресКонтрагента");
		РодительскиеГруппы.Добавить("ГруппаПочтовыйАдресКонтрагента");
		РодительскиеГруппы.Добавить("ГруппаЮрАдресДопДействия");
		РодительскиеГруппы.Добавить("ГруппаФактическийАдрес");
		РодительскиеГруппы.Добавить("ГруппаПочтовыйАдрес");
		РодительскиеГруппы.Добавить("ГруппаКонтактнаяИнформацияПолеТелефонКонтрагента");
		РодительскиеГруппы.Добавить("ГруппаКонтактнаяИнформацияПолеФаксКонтрагенты");
		РодительскиеГруппы.Добавить("ГруппаКонтактнаяИнформацияПолеEmailКонтрагенты");
		РодительскиеГруппы.Добавить("ГруппаКонтактнаяИнформацияПолеДругаяИнформацияКонтрагенты");
		
		Для Каждого Элемент из Элементы цикл
			
			Если НЕ ТипЗнч(Элемент.Родитель) = Тип("ГруппаФормы") тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ РодительскиеГруппы.Найти(Элемент.Родитель.Имя) = Неопределено ТОгда
				Если ТипЗнч(Элемент) = Тип("КнопкаФормы") тогда
					Элемент.Доступность = Истина;
				ИначеЕсли ТипЗнч(Элемент) = Тип("ПолеФормы") тогда
					Элемент.ТолькоПросмотр = Ложь;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
